# Languages & Runtimes
brew "go"
brew "node"
brew "rustup-init"
brew "rustup"
brew "deno"
brew "pnpm"

# Personal
tap "rnaudi/tap"
brew "rnaudi/tap/gh-log"
brew "rnaudi/tap/aitrace"
brew "rnaudi/tap/aipair"

# Opencode
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"

# Development Tools
brew "awscli"
cask "aws-vault-binary"
brew "cmake"
brew "delve"
brew "gopls"
brew "golangci-lint"
brew "neovim"
brew "npm"
brew "ruby"
brew "xcodes"
brew "capnp"
brew "mdbook"

# Container Tools
brew "docker-compose"
cask "docker-desktop"
brew "helm"
brew "kubernetes-cli"
brew "k9s"

# SVC
brew "git"
brew "gh"
brew "jj"
brew "difftastic"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CLI Utilities
brew "bat"
brew "cloc"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "mkcert"
brew "nmap"
brew "ripgrep"
brew "sd"
brew "tealdeer"
brew "tnftp"
brew "uv"
brew "wget"


# VSCode Extensions
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "ryanolsonx.distilled"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "denoland.vscode-deno"

# Go packages
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
